# print("hello,world!")
# 是Python的单行注释
# 其中'''   '''和'''   '''是Python的多行注释

'''缩进来代表代码块，缩进不一样可能会导致不能够运行
如果语句很长，可以用“\”来连接'''
'''关于准转义字符的理解，\是转义字符，有这个代表改变后面字符的意思，比如换行，制表之类的
在字符串前面加r的意思是后面一个“”内的所有东西都按照正常字符串类型输出'''

'''字符串的索引机制：
字符串:   H    e    l    l    o
正向:     0    1    2    3    4
反向:    -5   -4   -3   -2   -1
也可以切片，变量[数字]表示第几个，还可以str[start:end]，或者还能取步长，如str[start:end:step]
其中步长，如步长为2，从0开始，表示，索引的从第一个开始，依次加2，输出第0 2 4 ……个'''

'''列表——用[]
my_list = ['abcd', 786, 2.23, 'runoob', 70.2] 
可变的，可以用+来拼接

元组——用()
my_tuple = ('abcd', 786, 2.23, 'runoob', 70.2)
不可变！！，跟列表不一样，可以把字符串看成是特殊的元组

集合——用{}
sites = {'Google', 'Taobao', 'Runoob', 'Facebook', 'Zhihu', 'Baidu'}
无序性，唯一性，确定性，可以进行集合之间的运算
print(a - b)       # a 和 b 的差集（在 a 中但不在 b 中）
print(a | b)       # a 和 b 的并集（在 a 或 b 中）
print(a & b)       # a 和 b 的交集（同时在 a 和 b 中）
print(a ^ b)       # a 和 b 的对称差集（在 a 或 b 中，但不同时存在）

字典——用{}
有点像是一种映射关系，必须要一一对应，用：表示对应的两个东西
student = {
    "name": "Alice",
    "age": 20,
    "major": "电子信息工程"
}
可变的，能修改
student["age"] = 21，就变成21了'''

#今天这个更像是跟着大纲现有一个初步的认识，应该还没深入，等下应该会有深入的知识